app/views/people/index.html.erb

        <td><%= person.current %></td>
        <td><%= person.group.name %></td>
        <td><%= Person.find(person.id).wish_list.pluck(:item) %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "wishlists"."item" FROM "wishlists" WHERE "wishlists"."person_id" = ?  [["person_id", 1]]