app/views/people/show.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Group:</strong>
  <%= @person.group.name %>

SELECT "wishlists"."item" FROM "wishlists" WHERE "wishlists"."person_id" = ?  [["person_id", 1]]
---
  <strong>Wishlist:</strong>
  <%= Person.find(@person.id).wish_list.pluck(:item) %>