app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
INSERT INTO "groups" ("name", "max_amt", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Burns Family"], ["max_amt", 25], ["user_id", 1], ["created_at", "2019-03-22 17:13:31.654832"], ["updated_at", "2019-03-22 17:13:31.654832"]]
---
  def index
    @groupArray = Array.new
    groupHash = Hash.new
    @groups = Group.all
    @groups.each do |group|
      puts "group is"
      p group
      puts "group id is "+group.id.to_s
      count = Person.where(:group_id => group.id).count

      groupHash = {name: group.name, max_amt: group.max_amt, user: group.user, count: count, group: group}
      @groupArray.push(groupHash)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]
---
  def show
    # @people = Person.where(["group_id = :id", { id: session[:group_id] }])
    @people = Person.where(group_id: params[:id]).includes(:group)
    puts "@people is "+@people.to_s
    @people.each do |person|

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    end

    puts "Randomizing is finished!"
    @group = Group.find(params[:id])

INSERT INTO "groups" ("name", "max_amt", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "VIP Section"], ["max_amt", 10], ["user_id", 11], ["created_at", "2019-03-28 16:21:35.942277"], ["updated_at", "2019-03-28 16:21:35.942277"]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "Important People"], ["updated_at", "2019-03-28 16:40:59.324897"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @group.update(group_params)