app/controllers/people_controller.rb

  def wish
    if session[:person_id] != nil
      @wishlists = Person.find(session[:person_id]).wish_list
      puts "@wishlist is "+@wishlists.to_s
    else
      @wishlists = Person.find(params[:id]).wish_list
---
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."person_id" = ?  [["person_id", 1]]
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."person_id" = ?  [["person_id", 13]]

  def index
    @people = Person.all
    puts "Session[:user_id] is "+session[:user_id].to_s
    person = Person.find_by name: session[:user_name]

    if person.present?
      puts "person is "+person.to_s
      puts "the person ID is "+person.id.to_s
      @wishlists = Person.find(person.id).wish_list.pluck(:item)
---
SELECT "wishlists"."item" FROM "wishlists" WHERE "wishlists"."person_id" = ?  [["person_id", 1]]

  def show
    # @wishlists = Wishlist.joins(:person).where(:people => { :id => 1 }) # gets the whole row
    puts "Person name: "+session[:user_name]
    puts "params = "+params[:id]
    @person = Person.find_by name: session[:user_name]
    if @person == nil
      @person = Person.find_by id: params[:id]
    end
    if @person.present?
      @wishlists = Person.find(@person.id).wish_list.pluck(:item)
---
SELECT "wishlists"."item" FROM "wishlists" WHERE "wishlists"."person_id" = ?  [["person_id", 13]]