app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
---
  def login_user
    # to do: check the password and email with bcrypt to allow user to proceed
    # if isValid, User.new(user_params)
    @user = User.find_by email: params[:email].downcase

INSERT INTO "users" ("name", "email", "password_digest", "isAdmin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    puts "We are now in create..................."
    puts "@user is  "+@user.to_s

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "stanley@lee.com"], ["password_digest", "$2a$10$WoyWiN6qGHZMMaMkO0KfUuZT9X9L3deZ9V5x6kB/GQnh0whIB2wla"], ["updated_at", "2019-03-28 16:40:42.397214"], ["id", 12]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def log_in(user)
      puts "logging in user..."
      session[:user_id] = user.id
      puts "user_id: "+user.id.to_s
      session[:user_name] = user.name
      puts "user_name: "+user.name.to_s
      person = Person.find_by name: user.name
      if person.present?
        session[:group_id] = person.group_id
        session[:person_id] = person.id
        puts "person.group_id: "+person.group_id.to_s
      end
      puts "if session[:user_id]: "+session[:user_id].to_s
      if session[:user_id]
        @current_user ||= User.find_by(id: session[:user_id])