app/controllers/wishlists_controller.rb

SELECT "wishlists".* FROM "wishlists"
---
  def index
    @wishlists = Wishlist.all

INSERT INTO "wishlists" ("item", "description", "person_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item", "Car"], ["description", "Matchbox Shelby Cobra"], ["person_id", 1], ["created_at", "2019-03-22 18:41:49.560771"], ["updated_at", "2019-03-22 18:41:49.560771"]]
---
  def create
    @wishlist = Wishlist.new(wishlist_params)

    respond_to do |format|
      if @wishlist.save

DELETE FROM "wishlists" WHERE "wishlists"."id" = ?  [["id", 3]]
---
  def destroy
    @wishlist.destroy

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wishlist
      @wishlist = Wishlist.find(params[:id])